In [1]:
import pandas as pd

In [2]:
lunch = pd.read_csv('food.csv')

In [3]:
lunch

   Serial    Product     Brand  Cost
0       1    DalRoti      Home   100
1       2  PalakRice      Home   110
2       3   VegThali   Canteen    45
3       4   EggThali   Canteen    55
4       5    Biryani  Paradise   150

In [4]:
lunch.columns

Index(['Serial', 'Product', 'Brand', 'Cost'], dtype='object')

In [5]:
lunch.columns[0:2]

Index(['Serial', 'Product'], dtype='object')

In [6]:
lunch.dtypes

Serial      int64
Product    object
Brand      object
Cost        int64
dtype: object

In [7]:
lunch.shape

(5, 4)

In [8]:
lunch.shape[1]

4

In [11]:
lunch.head(2)

   Serial    Product Brand  Cost
0       1    DalRoti  Home   100
1       2  PalakRice  Home   110

In [12]:
#mutable
#variable columns
#labebled axes
#arth operations on columns & rows

In [13]:
dfa = pd.DataFrame({'company':['Amazon', 'Microsoft', 'Google', 'Alibaba', 'ibm'], 'name':['AWS', 'Azzure', 'GCP', 'challis', 'watson'], 'Founded':[1994, 1976, 2004, 2020, 2010]})

In [14]:
dfa

     company     name  Founded
0     Amazon      AWS     1994
1  Microsoft   Azzure     1976
2     Google      GCP     2004
3    Alibaba  challis     2020
4        ibm   watson     2010

In [15]:
dfa.index = ['Second', 'First', 'Third', 'Fourth', 'Fifth']

In [16]:
dfa

          company     name  Founded
Second     Amazon      AWS     1994
First   Microsoft   Azzure     1976
Third      Google      GCP     2004
Fourth    Alibaba  challis     2020
Fifth         ibm   watson     2010

In [18]:
dfa['company']

Second       Amazon
First     Microsoft
Third        Google
Fourth      Alibaba
Fifth           ibm
Name: company, dtype: object

In [19]:
print(dfa['company'])

Second       Amazon
First     Microsoft
Third        Google
Fourth      Alibaba
Fifth           ibm
Name: company, dtype: object

In [20]:
dfa[['company']]

          company
Second     Amazon
First   Microsoft
Third      Google
Fourth    Alibaba
Fifth         ibm

In [21]:
#loc
#iloc

In [22]:
dfa.loc[['Second', 'Fifth']]

       company    name  Founded
Second  Amazon     AWS     1994
Fifth      ibm  watson     2010

In [23]:
dfb = dfa.loc[['Second', 'Fifth']]

In [24]:
type(dfa)

pandas.core.frame.DataFrame

In [25]:
type(dfb)

pandas.core.frame.DataFrame

In [26]:
dfb

       company    name  Founded
Second  Amazon     AWS     1994
Fifth      ibm  watson     2010

In [27]:
dfa

          company     name  Founded
Second     Amazon      AWS     1994
First   Microsoft   Azzure     1976
Third      Google      GCP     2004
Fourth    Alibaba  challis     2020
Fifth         ibm   watson     2010

In [28]:
dfa.iloc[3]

company    Alibaba
name       challis
Founded       2020
Name: Fourth, dtype: object

In [30]:
dfa.iloc[1:3]

         company    name  Founded
First  Microsoft  Azzure     1976
Third     Google     GCP     2004

In [32]:
dfa.iloc[:, 1:4]

           name  Founded
Second      AWS     1994
First    Azzure     1976
Third       GCP     2004
Fourth  challis     2020
Fifth    watson     2010

In [33]:
lunch

   Serial    Product     Brand  Cost
0       1    DalRoti      Home   100
1       2  PalakRice      Home   110
2       3   VegThali   Canteen    45
3       4   EggThali   Canteen    55
4       5    Biryani  Paradise   150

In [35]:
lunch.dtypes

Serial      int64
Product    object
Brand      object
Cost        int64
dtype: object

In [36]:
lunch.Cost = lunch.Cost.astype(float)

In [37]:
lunch.dtypes

Serial       int64
Product     object
Brand       object
Cost       float64
dtype: object

In [38]:
lunch.index = ['A', 'B', 'A', 'A', 'C']

In [39]:
lunch

   Serial    Product     Brand   Cost
A       1    DalRoti      Home  100.0
B       2  PalakRice      Home  110.0
A       3   VegThali   Canteen   45.0
A       4   EggThali   Canteen   55.0
C       5    Biryani  Paradise  150.0

In [40]:
lunch.index.value_counts()

A    3
B    1
C    1
dtype: int64

In [42]:
pass

In [43]:
pd.crosstab(lunch.index, lunch.Brand)

Brand  Canteen  Home  Paradise
row_0
A            2     1         0
B            0     1         0
C            0     0         1

In [44]:
lunch

   Serial    Product     Brand   Cost
A       1    DalRoti      Home  100.0
B       2  PalakRice      Home  110.0
A       3   VegThali   Canteen   45.0
A       4   EggThali   Canteen   55.0
C       5    Biryani  Paradise  150.0

In [45]:
lunch.set_index('Product')

           Serial     Brand   Cost
Product
DalRoti         1      Home  100.0
PalakRice       2      Home  110.0
VegThali        3   Canteen   45.0
EggThali        4   Canteen   55.0
Biryani         5  Paradise  150.0

In [47]:
dfa.set_index('company', inplace=True)

              name  Founded
company
Amazon         AWS     1994
Microsoft   Azzure     1976
Google         GCP     2004
Alibaba    challis     2020
ibm         watson     2010

In [48]:
dfa

          company     name  Founded
Second     Amazon      AWS     1994
First   Microsoft   Azzure     1976
Third      Google      GCP     2004
Fourth    Alibaba  challis     2020
Fifth         ibm   watson     2010

In [49]:
dfa.set_index('company', inplace=True)

In [50]:
dfa

              name  Founded
company
Amazon         AWS     1994
Microsoft   Azzure     1976
Google         GCP     2004
Alibaba    challis     2020
ibm         watson     2010

In [51]:
dfa.reset_index(inplace=True)

In [52]:
dfa

     company     name  Founded
0     Amazon      AWS     1994
1  Microsoft   Azzure     1976
2     Google      GCP     2004
3    Alibaba  challis     2020
4        ibm   watson     2010

In [53]:
lunch

   Serial    Product     Brand   Cost
A       1    DalRoti      Home  100.0
B       2  PalakRice      Home  110.0
A       3   VegThali   Canteen   45.0
A       4   EggThali   Canteen   55.0
C       5    Biryani  Paradise  150.0

In [60]:
temp = lunch[lunch['Brand'] == 'Home']

array([[1, 'DalRoti', 'Home', 100.0],
       [2, 'PalakRice', 'Home', 110.0]], dtype=object)

In [62]:
lunch['Brand'].value_counts

<bound method IndexOpsMixin.value_counts of A        Home
B        Home
A     Canteen
A     Canteen
C    Paradise
Name: Brand, dtype: object>

In [63]:
type(temp)

pandas.core.frame.DataFrame

In [64]:
temp

   Serial    Product Brand   Cost
A       1    DalRoti  Home  100.0
B       2  PalakRice  Home  110.0

In [66]:
temp.shape[0]

2

In [67]:
lunch.sort_values('Cost')

   Serial    Product     Brand   Cost
A       3   VegThali   Canteen   45.0
A       4   EggThali   Canteen   55.0
A       1    DalRoti      Home  100.0
B       2  PalakRice      Home  110.0
C       5    Biryani  Paradise  150.0

In [68]:
lunch.sort_values('Cost', ascending=False)

   Serial    Product     Brand   Cost
C       5    Biryani  Paradise  150.0
B       2  PalakRice      Home  110.0
A       1    DalRoti      Home  100.0
A       4   EggThali   Canteen   55.0
A       3   VegThali   Canteen   45.0

In [69]:
dfa

     company     name  Founded
0     Amazon      AWS     1994
1  Microsoft   Azzure     1976
2     Google      GCP     2004
3    Alibaba  challis     2020
4        ibm   watson     2010

In [72]:
dfa.columns = ['Company', 'cloud', 'Founded']

In [73]:
#dfa.rename(columns = [])

In [74]:
lunch

   Serial    Product     Brand   Cost
A       1    DalRoti      Home  100.0
B       2  PalakRice      Home  110.0
A       3   VegThali   Canteen   45.0
A       4   EggThali   Canteen   55.0
C       5    Biryani  Paradise  150.0

In [75]:
lunch['Price'] = lunch.eval('Cost+(Cost*(0.05))')

In [76]:
lunch

   Serial    Product     Brand   Cost   Price
A       1    DalRoti      Home  100.0  105.00
B       2  PalakRice      Home  110.0  115.50
A       3   VegThali   Canteen   45.0   47.25
A       4   EggThali   Canteen   55.0   57.75
C       5    Biryani  Paradise  150.0  157.50

In [77]:
lunch.describe()

         Serial       Cost       Price
count  5.000000    5.00000    5.000000
mean   3.000000   92.00000   96.600000
std    1.581139   42.80771   44.948095
min    1.000000   45.00000   47.250000
25%    2.000000   55.00000   57.750000
50%    3.000000  100.00000  105.000000
75%    4.000000  110.00000  115.500000
max    5.000000  150.00000  157.500000

In [83]:
lunch.groupby('Brand').Price.min()

Brand
Canteen      47.25
Home        105.00
Paradise    157.50
Name: Price, dtype: float64

In [82]:
lunch

   Serial    Product     Brand   Cost   Price
A       1    DalRoti      Home  100.0  105.00
B       2  PalakRice      Home  110.0  115.50
A       3   VegThali   Canteen   45.0   47.25
A       4   EggThali   Canteen   55.0   57.75
C       5    Biryani  Paradise  150.0  157.50

In [87]:
lunch.groupby('Brand').Price.agg(['count', 'min', 'max', 'mean'])

          count     min     max    mean
Brand
Canteen       2   47.25   57.75   52.50
Home          2  105.00  115.50  110.25
Paradise      1  157.50  157.50  157.50

In [92]:
lunch.groupby('Brand').Serial.agg(['count'])

          count
Brand
Canteen       2
Home          2
Paradise      1

In [96]:
lunch_home = lunch[lunch.Brand=='Home']

   Serial    Product Brand   Cost  Price
A       1    DalRoti  Home  100.0  105.0
B       2  PalakRice  Home  110.0  115.5

In [94]:
lunch

   Serial    Product     Brand   Cost   Price
A       1    DalRoti      Home  100.0  105.00
B       2  PalakRice      Home  110.0  115.50
A       3   VegThali   Canteen   45.0   47.25
A       4   EggThali   Canteen   55.0   57.75
C       5    Biryani  Paradise  150.0  157.50

In [97]:
lunch_home = lunch[lunch.Brand=='Home']

In [98]:
lunch_home

   Serial    Product Brand   Cost  Price
A       1    DalRoti  Home  100.0  105.0
B       2  PalakRice  Home  110.0  115.5

In [99]:
dfa

     Company    cloud  Founded
0     Amazon      AWS     1994
1  Microsoft   Azzure     1976
2     Google      GCP     2004
3    Alibaba  challis     2020
4        ibm   watson     2010

In [100]:
dfa[dfa.index.isin([1,3])]

     Company    cloud  Founded
1  Microsoft   Azzure     1976
3    Alibaba  challis     2020

In [101]:
lunch.isnull()

   Serial  Product  Brand   Cost  Price
A   False    False  False  False  False
B   False    False  False  False  False
A   False    False  False  False  False
A   False    False  False  False  False
C   False    False  False  False  False

In [102]:
lunch.isnull().sum()

Serial     0
Product    0
Brand      0
Cost       0
Price      0
dtype: int64

In [103]:
#      dropna()
#.     fillna()

In [104]:
lunch.rank()

   Serial  Product  Brand  Cost  Price
A     1.0      2.0    3.5   3.0    3.0
B     2.0      4.0    3.5   4.0    4.0
A     3.0      5.0    1.5   1.0    1.0
A     4.0      3.0    1.5   2.0    2.0
C     5.0      1.0    5.0   5.0    5.0

In [105]:
lunch

   Serial    Product     Brand   Cost   Price
A       1    DalRoti      Home  100.0  105.00
B       2  PalakRice      Home  110.0  115.50
A       3   VegThali   Canteen   45.0   47.25
A       4   EggThali   Canteen   55.0   57.75
C       5    Biryani  Paradise  150.0  157.50

In [106]:
lunch_home

   Serial    Product Brand   Cost  Price
A       1    DalRoti  Home  100.0  105.0
B       2  PalakRice  Home  110.0  115.5

In [107]:
temp

   Serial    Product Brand   Cost
A       1    DalRoti  Home  100.0
B       2  PalakRice  Home  110.0

In [108]:
dfa

     Company    cloud  Founded
0     Amazon      AWS     1994
1  Microsoft   Azzure     1976
2     Google      GCP     2004
3    Alibaba  challis     2020
4        ibm   watson     2010

In [109]:
lunch

   Serial    Product     Brand   Cost   Price
A       1    DalRoti      Home  100.0  105.00
B       2  PalakRice      Home  110.0  115.50
A       3   VegThali   Canteen   45.0   47.25
A       4   EggThali   Canteen   55.0   57.75
C       5    Biryani  Paradise  150.0  157.50

In [110]:
pd.concat([lunch, dfa, temp])

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      Brand    Company   Cost  Founded   Price    Product  Serial    cloud
A      Home        NaN  100.0      NaN  105.00    DalRoti     1.0      NaN
B      Home        NaN  110.0      NaN  115.50  PalakRice     2.0      NaN
A   Canteen        NaN   45.0      NaN   47.25   VegThali     3.0      NaN
A   Canteen        NaN   55.0      NaN   57.75   EggThali     4.0      NaN
C  Paradise        NaN  150.0      NaN  157.50    Biryani     5.0      NaN
0       NaN     Amazon    NaN   1994.0     NaN        NaN     NaN      AWS
1       NaN  Microsoft    NaN   1976.0     NaN        NaN     NaN   Azzure
2       NaN     Google    NaN   2004.0     NaN        NaN     NaN      GCP
3       NaN    Alibaba    NaN   2020.0     NaN        NaN     NaN  challis
4       NaN        ibm    NaN   2010.0     NaN        NaN     NaN   watson
A      Home        NaN  100.0      NaN     NaN    DalRoti     1.0      NaN
B      Home        NaN  110.0      NaN     NaN  PalakRice     2.0      NaN

In [111]:
help(pd.concat)

Help on function concat in module pandas.core.reshape.concat:

concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=None, copy=True)
    Concatenate pandas objects along a particular axis with optional set logic
    along the other axes.

    Can also add a layer of hierarchical indexing on the concatenation axis,
    which may be useful if the labels are the same (or overlapping) on
    the passed axis number.

    Parameters
    ----------
    objs : a sequence or mapping of Series, DataFrame, or Panel objects
        If a dict is passed, the sorted keys will be used as the `keys`
        argument, unless it is passed, in which case the values will be
        selected (see below). Any None objects will be dropped silently unless
        they are all None in which case a ValueError will be raised
    axis : {0/'index', 1/'columns'}, default 0
        The axis to concatenate along
    join : {'inner', 'outer'}, default 'outer'
        How to handle indexes on other axis(es)
    join_axes : list of Index objects
        Specific indexes to use for the other n - 1 axes instead of performing
        inner/outer set logic
    ignore_index : boolean, default False
        If True, do not use the index values along the concatenation axis. The
        resulting axis will be labeled 0, ..., n - 1. This is useful if you are
        concatenating objects where the concatenation axis does not have
        meaningful indexing information. Note the index values on the other
        axes are still respected in the join.
    keys : sequence, default None
        If multiple levels passed, should contain tuples. Construct
        hierarchical index using the passed keys as the outermost level
    levels : list of sequences, default None
        Specific levels (unique values) to use for constructing a
        MultiIndex. Otherwise they will be inferred from the keys
    names : list, default None
        Names for the levels in the resulting hierarchical index
    verify_integrity : boolean, default False
        Check whether the new concatenated axis contains duplicates. This can
        be very expensive relative to the actual data concatenation
    sort : boolean, default None
        Sort non-concatenation axis if it is not already aligned when `join`
        is 'outer'. The current default of sorting is deprecated and will
        change to not-sorting in a future version of pandas.

        Explicitly pass ``sort=True`` to silence the warning and sort.
        Explicitly pass ``sort=False`` to silence the warning and not sort.

        This has no effect when ``join='inner'``, which already preserves
        the order of the non-concatenation axis.

        .. versionadded:: 0.23.0

    copy : boolean, default True
        If False, do not copy data unnecessarily

    Returns
    -------
    concatenated : object, type of objs
        When concatenating all ``Series`` along the index (axis=0), a
        ``Series`` is returned. When ``objs`` contains at least one
        ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
        the columns (axis=1), a ``DataFrame`` is returned.

    See Also
    --------
    Series.append
    DataFrame.append
    DataFrame.join
    DataFrame.merge

    Notes
    -----
    The keys, levels, and names arguments are all optional.

    A walkthrough of how this method fits in with other tools for combining
    pandas objects can be found `here
    <http://pandas.pydata.org/pandas-docs/stable/merging.html>`__.

    Examples
    --------
    Combine two ``Series``.

    >>> s1 = pd.Series(['a', 'b'])
    >>> s2 = pd.Series(['c', 'd'])
    >>> pd.concat([s1, s2])
    0    a
    1    b
    0    c
    1    d
    dtype: object

    Clear the existing index and reset it in the result
    by setting the ``ignore_index`` option to ``True``.

    >>> pd.concat([s1, s2], ignore_index=True)
    0    a
    1    b
    2    c
    3    d
    dtype: object

    Add a hierarchical index at the outermost level of
    the data with the ``keys`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2',])
    s1  0    a
        1    b
    s2  0    c
        1    d
    dtype: object

    Label the index keys you create with the ``names`` option.

    >>> pd.concat([s1, s2], keys=['s1', 's2'],
    ...           names=['Series name', 'Row ID'])
    Series name  Row ID
    s1           0         a
                 1         b
    s2           0         c
                 1         d
    dtype: object

    Combine two ``DataFrame`` objects with identical columns.

    >>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
    ...                    columns=['letter', 'number'])
    >>> df1
      letter  number
    0      a       1
    1      b       2
    >>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
    ...                    columns=['letter', 'number'])
    >>> df2
      letter  number
    0      c       3
    1      d       4
    >>> pd.concat([df1, df2])
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects with overlapping columns
    and return everything. Columns outside the intersection will
    be filled with ``NaN`` values.

    >>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
    ...                    columns=['letter', 'number', 'animal'])
    >>> df3
      letter  number animal
    0      c       3    cat
    1      d       4    dog
    >>> pd.concat([df1, df3], sort=False)
      letter  number animal
    0      a       1    NaN
    1      b       2    NaN
    0      c       3    cat
    1      d       4    dog

    Combine ``DataFrame`` objects with overlapping columns
    and return only those that are shared by passing ``inner`` to
    the ``join`` keyword argument.

    >>> pd.concat([df1, df3], join="inner")
      letter  number
    0      a       1
    1      b       2
    0      c       3
    1      d       4

    Combine ``DataFrame`` objects horizontally along the x axis by
    passing in ``axis=1``.

    >>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
    ...                    columns=['animal', 'name'])
    >>> pd.concat([df1, df4], axis=1)
      letter  number  animal    name
    0      a       1    bird   polly
    1      b       2  monkey  george

    Prevent the result from including duplicate index values with the
    ``verify_integrity`` option.

    >>> df5 = pd.DataFrame([1], index=['a'])
    >>> df5
       0
    a  1
    >>> df6 = pd.DataFrame([2], index=['a'])
    >>> df6
       0
    a  2
    >>> pd.concat([df5, df6], verify_integrity=True)
    Traceback (most recent call last):
        ...
    ValueError: Indexes have overlapping values: ['a']